In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 
 
'Budapest_PaRis', 'Brussels_londOn'], 
 
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085], 
 
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]], 
 
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', 
 
'12. Air France', '"Swiss Air"']})

In [3]:
df.head()

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

# 1

In [4]:
for i in range(0,df['FlightNumber'].count()+1):
    if pd.isnull(df['FlightNumber'].iloc[i,]):
        df['FlightNumber'].iloc[i] = df['FlightNumber'].iloc[i-1,]+10

df['FlightNumber']

C:\Users\roguser\Anaconda3\lib\site-packages\pandas\core\indexing.py:190: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self._setitem_with_indexer(indexer, value)

0    10045.0
1    10055.0
2    10065.0
3    10075.0
4    10085.0
Name: FlightNumber, dtype: float64

In [5]:
df.head()

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
From_To         5 non-null object
FlightNumber    5 non-null float64
RecentDelays    5 non-null object
Airline         5 non-null object
dtypes: float64(1), object(3)
memory usage: 240.0+ bytes

In [7]:
df['FlightNumber'] = [int(i) for i in df['FlightNumber']]

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
From_To         5 non-null object
FlightNumber    5 non-null int64
RecentDelays    5 non-null object
Airline         5 non-null object
dtypes: int64(1), object(3)
memory usage: 240.0+ bytes

In [9]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

# 2

In [10]:
df['new'] = df['From_To'].str.split('_')

In [11]:
df.head()

,From_To,FlightNumber,RecentDelays,Airline,new
0,LoNDon_paris,10045,"[23, 47]",KLM(!),"[LoNDon, paris]"
1,MAdrid_miLAN,10055,[],<Air France> (12),"[MAdrid, miLAN]"
2,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways. ),"[londON, StockhOlm]"
3,Budapest_PaRis,10075,[13],12. Air France,"[Budapest, PaRis]"
4,Brussels_londOn,10085,"[67, 32]","""Swiss Air""","[Brussels, londOn]"

In [12]:
df['To'] = [i[1] for i in df['new']]

In [13]:
df['From'] = [i[0] for i in df['new']]

In [14]:
df.drop('new',1,inplace=True)

In [15]:
df.head()

,From_To,FlightNumber,RecentDelays,Airline,To,From
0,LoNDon_paris,10045,"[23, 47]",KLM(!),paris,LoNDon
1,MAdrid_miLAN,10055,[],<Air France> (12),miLAN,MAdrid
2,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways. ),StockhOlm,londON
3,Budapest_PaRis,10075,[13],12. Air France,PaRis,Budapest
4,Brussels_londOn,10085,"[67, 32]","""Swiss Air""",londOn,Brussels

# 3 & 4

In [16]:
df['From'] = [i.capitalize() for i in df['From']]

In [17]:
df['To'] = [i.capitalize() for i in df['To']]

In [18]:
df.drop('From_To',1,inplace=True)
df.head()

   FlightNumber  RecentDelays              Airline         To      From
0         10045      [23, 47]               KLM(!)      Paris    London
1         10055            []    <Air France> (12)      Milan    Madrid
2         10065  [24, 43, 87]  (British Airways. )  Stockholm    London
3         10075          [13]       12. Air France      Paris  Budapest
4         10085      [67, 32]          "Swiss Air"     London  Brussels

# 5

In [19]:
df3 = pd.DataFrame(df.RecentDelays.values.tolist())

In [20]:
df3

      0     1     2
0  23.0  47.0   NaN
1   NaN   NaN   NaN
2  24.0  43.0  87.0
3  13.0   NaN   NaN
4  67.0  32.0   NaN

In [21]:
df.head()

   FlightNumber  RecentDelays              Airline         To      From
0         10045      [23, 47]               KLM(!)      Paris    London
1         10055            []    <Air France> (12)      Milan    Madrid
2         10065  [24, 43, 87]  (British Airways. )  Stockholm    London
3         10075          [13]       12. Air France      Paris  Budapest
4         10085      [67, 32]          "Swiss Air"     London  Brussels

In [22]:
df_all = pd.concat([df,df3],axis=1)
df_all

,FlightNumber,RecentDelays,Airline,To,From,0,1,2
0,10045,"[23, 47]",KLM(!),Paris,London,23.0,47.0,NaN
1,10055,[],<Air France> (12),Milan,Madrid,NaN,NaN,NaN
2,10065,"[24, 43, 87]",(British Airways. ),Stockholm,London,24.0,43.0,87.0
3,10075,[13],12. Air France,Paris,Budapest,13.0,NaN,NaN
4,10085,"[67, 32]","""Swiss Air""",London,Brussels,67.0,32.0,NaN

In [23]:
df_all = df_all.rename(columns={0:'Delay_1',1:'Delay_2',2:'Delay_3'})

In [24]:
df_all.drop('RecentDelays',1,inplace=True)

In [25]:
df_all

,FlightNumber,Airline,To,From,Delay_1,Delay_2,Delay_3
0,10045,KLM(!),Paris,London,23.0,47.0,NaN
1,10055,<Air France> (12),Milan,Madrid,NaN,NaN,NaN
2,10065,(British Airways. ),Stockholm,London,24.0,43.0,87.0
3,10075,12. Air France,Paris,Budapest,13.0,NaN,NaN
4,10085,"""Swiss Air""",London,Brussels,67.0,32.0,NaN